<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use App\Models\Broadcast;
use App\Models\Group;
use App\Models\User;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        // \App\Models\User::factory(10)->create();

         User::create([
             'firstname' => 'ali',
             'lastname' => 'alizade',
             'number' => '09396125117',
             'email' => 'test@example.com',
             'password' => '12341234',
             'area' => '1',
             'address' => 'hamedan',
             'group_id' => null,
         ]);
         User::create([
             'firstname' => 'admin',
             'lastname' => 'admin',
             'number' => '09181111111',
             'email' => 'admin@panel.com',
             'password' => '12341234',
             'role' => '2',
             'area' => '1',
             'address' => 'hamedan',
             'group_id' => null,
         ]);
         Group::create([
             'title' => 'گروه 1',
             'details' => 'جولان -شهدا- باباطاهر -امامزاده عبداله -تپه هگمتانه -اکباتان- قلیانی -خضریان- ۱۷ شهریور -خیابان اراک',
             'time' => 'هفته های اول و دوم ساعت  ۱۵ تا ۲۱ و هفته سوم و چهار ۸ تا ۱۵',
         ]);
         Group::create([
             'title' => 'گروه 2',
             'details' => 'مجید اباد- صدف- فردوسی- چیت سازیان- تختی -بنی هاشم -جعفر طیار -سالن ورزشی صخره نوردی- خیابان حکما- قسمتی از جاده مزداگینه پایین -قسمت قدیم تپه امام گل -بلوار بهشت -شهرک مدنی',
             'time' => 'هفته های اول و دوم ساع ۸ تا ۱۵ و هفته سوم و چهار ۱۵ تا ۲۱',
         ]);
         Group::create([
             'title' => 'گروه 3',
             'details' => 'بافت قدیم شهر- طالقانی -خیابان بوعلی -میرزاده عشقی -ایستگاه عباس اباد- خواجه رشید -کاشانی -شریعتی- شکریه شرقی- پاستور- اقاجانی بیک -بلوار مدنی- بین النهرین -قاشق تراش ها -خیابان عباس اباد -قسمتی از خیابان باباطاهر',
             'time' => 'هفته های اول و دوم ساعت  ۱۵ تا ۲۱ و هفته سوم و چهار ۸ تا ۱۵',
         ]);
         Group::create([
             'title' => 'گروه 4',
             'details' => 'روبروی بیمارستان بعثت -شهرک بهشتی- تپه امام گل -بیمارستان بعثت -حصار حاج شمسعلی -مزداگینه -زیر پل رسالت -قسمتی از حاج عنایت -العش',
             'time' => 'هفته های اول و دوم ساع ۸ تا ۱۵ و هفته سوم و چهار ۱۵ تا ۲۱',
         ]);
         Group::create([
             'title' => 'گروه 5',
             'details' => 'بلوار بهشت- کوی جنت -شهرک امید اکباتان -شهرک اندیشه- ۱۰ متری رضوان -خضر -مجتمع سینا و بوعلی',
             'time' => 'هفته های اول و دوم ساعت  ۱۵ تا ۲۱ و هفته سوم و چهار ۸ تا ۱۵',
         ]);
         Group::create([
             'title' => 'گروه 6',
             'details' => 'هنرستان- شکریه غربی -جوادیه -شهرک مدرس -مهدیه- زمانی -منوچهری- دیزج -حصار مطهری -مریانج -شهرک الوند- جانبازان- ۶۰۰ دستگاه- حصار امام- اسلامشهر',
             'time' => 'هفته های اول و دوم ساعت ۸ تا ۱۵ و هفته سوم و چهار ۱۵ تا ۲۱',
         ]);
         Group::create([
             'title' => 'گروه 7',
             'details' => 'رکنی -پیشاهنگی- قسمتی از بلوار فاطمیه -جهان نما- گلزار-سنگشیر- سعیدیه بالا -بیمارستان بهشتی -ام ار ای مهدیه- بلوار شهید فهمیده- ارام شرقی و غربی -بلوار ارم قسمت شمالی',
             'time' => 'هفته های اول و دوم ساعت  ۱۵ تا ۲۱ و هفته سوم و چهار ۸ تا ۱۵',
         ]);
         Group::create([
             'title' => 'گروه 8',
             'details' => 'پردیس -استادان- متخصصین -اعتمادیه- نایب احمد- شهرک امیرکبیر تا پل رسالت و ابتدای جاده کشین -ابتدای جاده فقیره- جاده دره مراد بیک -سعیدیه بالا -شهرک چمران- ۳
 متری عمار- کوچه مشکی -۱۸ متری ذوالفقار- سنگ سفید',
             'time' => 'هفته های اول و دوم ساعت ۸ تا ۱۵ و هفته سوم و چهار ۱۵ تا ۲۱',
         ]);
         Group::create([
             'title' => 'گروه 9',
             'details' => 'شهرک فرهنگیان- حاجی اباد- علی اباد فرهنگیان- حصار راه علی اباد قاسم باد',
             'time' => 'هفته های اول و دوم ساع  ۱۵ تا ۲۱ و هفته سوم و چهار ۸ تا ۱۵',
         ]);

         Broadcast::create([
             'title' => 'هنرستان',
             'address' => 'همدان , بلوار بعثت , خیابان هنرستان , جنب پارک نواری',
             'time' => '11 صبح',
             'area' => '1',
             'volume' => '-',
         ]);
         Broadcast::create([
             'title' => 'استادان',
             'address' => 'همدان , میدان بیمه , بلوار استادان , ۱۸متری فجر',
             'time' => '13 ظهر',
             'area' => '1',
             'volume' => '-',
         ]);
         Broadcast::create([
             'title' => 'سعیدیه',
             'address' => 'همدان , بلوار بعثت , پارک سعیدیه',
             'time' => '9 ظهر',
             'area' => '1',
             'volume' => '-',
         ]);
         Broadcast::create([
             'title' => 'بهار',
             'address' => 'بهار , خیابان امام , کوچه صمدی',
             'time' => '11 ظهر',
             'area' => '1',
             'volume' => '-',
         ]);

    }
}
